
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>轻松Scrum之旅1 : Baron Zhao's Blog</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="好记性不如烂笔头，记录日常遇到的问题及学习的成果">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    <meta name="keywords" content="Baron Zhao's Blog">
    <meta name="HandheldFriendly" content="true">
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    
    <link rel="shortcut icon" href="../assets/images/favicon.ico" type="image/x-icon">
     
    <link rel="stylesheet" href="../assets/website/page_custom.min.css">
    
    <link rel="next" href="202001-java-kaptcha.html" />
    
    
    <link rel="prev" href="201901-markdown-rules.html" />
    

    </head>
    <body>
        
<div class="gb-page-wrapper">
    <header class="gb-page-header">
        <div class="container">
        
            <!-- search_input -->
            <div id="book-search-input" role="search">
                <input type="text" placeholder="输入并搜索" />
            </div>
            <!-- search_input -->
            
            <a href=".." class="logo">
                <img src="../assets/images/logo.png"/>
            </a>
            
            <a href=".." class="logo">
                <h1>Baron Zhao's Blog</h1>
            </a>
        
        </div>
    </header>

    <div class="gb-page-body">
        <div class="gb-page-inner">
            <div class="container">
                <div class="row">
                    <div class="col-md-3">
                        



    
    <div class="panel panel-default">
        

        <div class="list-group">
            
    
        
        <a href="../" class="list-group-item ">
        

            

            

            写在首页

        
        </a>
        

        
    
        
        <a href="../202001-big-plans-in-2020.html" class="list-group-item ">
        

            

            

            新年计划

        
        </a>
        

        
    
        
        <a href="./" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-down"></i>
            

            技术杂谈

        
        </a>
        

        
        
    
        
        <a href="201901-markdown-rules.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            Markdown语法

        
        </a>
        

        
    
        
        <a href="201901-easy-scrum-tour-1.html" class="list-group-item active">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            轻松Scrum之旅1

        
        </a>
        

        
    
        
        <a href="202001-java-kaptcha.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            验证码组件Kaptcha

        
        </a>
        

        
    

        
    
        
        <a href="../plans/" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            历年计划

        
        </a>
        

        
    

        </div>
    </div>
    



                    </div>
                    <div class="col-md-9">
                        <!-- search_result -->
                        <div id="book-search-results">
                            <div class="search-noresults">
                                
                                <!-- page -->
                                
                                <div class="gb-markdown book-page-inner page-inner">
                                    <h3 id="&#x5173;&#x4E8E;&#x8FD9;&#x672C;&#x4E66;">&#x5173;&#x4E8E;&#x8FD9;&#x672C;&#x4E66;</h3>
<p>&#x300A;&#x8F7B;&#x677E;Scrum&#x4E4B;&#x65C5;&#x300B;&#x662F;&#x4E00;&#x672C;&#x9605;&#x8BFB;&#x53CB;&#x597D;&#x7684;&#x6280;&#x672F;&#x4E66;&#xFF0C;&#x4F5C;&#x8005;&#x7ED9;&#x6211;&#x4EEC;&#x8BB2;&#x8FF0;&#x4E86;&#x5728;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x4F7F;&#x7528;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x7BA1;&#x7406;&#x56DB;&#x6B21;&#x8FED;&#x4EE3;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x5C06;&#x6280;&#x672F;&#x7A7F;&#x63D2;&#x5728;&#x6545;&#x4E8B;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x629B;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x89E3;&#x51B3;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C42;&#x5C42;&#x63A8;&#x8FDB;&#xFF0C;&#x8BA9;&#x8BFB;&#x8005;&#x6709;&#x79CD;&#x53C2;&#x4E0E;&#x5728;&#x5176;&#x4E2D;&#x7684;&#x611F;&#x89C9;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x7531;&#x4E8E;&#x8FD9;&#x672C;&#x4E66;&#x5199;&#x7684;&#x6BD4;&#x8F83;&#x65E9;&#xFF0C;&#x4E66;&#x4E2D;&#x7684;&#x6709;&#x4E9B;&#x5DE5;&#x5177;&#x5DF2;&#x7ECF;&#x8FC7;&#x65F6;&#xFF0C;&#x4F46;&#x662F;&#x4E66;&#x4E2D;&#x4ECB;&#x7ECD;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x7684;&#x5404;&#x79CD;&#x6982;&#x5FF5;&#x3001;&#x5B9E;&#x8DF5;&#x548C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x601D;&#x8DEF;&#x4F9D;&#x65E7;&#x6709;&#x5B9D;&#x8D35;&#x7684;&#x501F;&#x9274;&#x610F;&#x4E49;&#xFF0C;&#x4F5C;&#x4E3A;&#x5165;&#x95E8;&#x4E66;&#x7C4D;&#xFF0C;&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x3002;</p>
<p><strong>&#x4E16;&#x4E0A;&#x5145;&#x6EE1;&#x65E0;&#x6570;&#x7684;&#x9009;&#x62E9;&#x548C;&#x52AA;&#x529B;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x6210;&#x529F;&#xFF0C;&#x9009;&#x62E9;&#x5927;&#x4E8E;&#x52AA;&#x529B;&#x3002;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x662F;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x3002;</strong>  </p>
<h3 id="&#x4EC0;&#x4E48;&#x662F;&#x654F;&#x6377;&#x5F00;&#x53D1;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x654F;&#x6377;&#x5F00;&#x53D1;&#xFF1F;</h3>
<p>&#x654F;&#x6377;&#x5F00;&#x53D1;&#x662F;&#x4E00;&#x79CD;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x5B66;&#xFF08;Methodology&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x5E94;&#x5BF9;&#x5BA2;&#x6237;&#x5FEB;&#x901F;&#x53D8;&#x66F4;&#x7684;&#x9700;&#x6C42;&#x3002;&#x5B83;&#x5F3A;&#x8C03;<strong>&#x4EE5;&#x4EBA;&#x4E3A;&#x6838;&#x5FC3;&#xFF0C;&#x91C7;&#x7528;&#x8FED;&#x4EE3;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5FAA;&#x5E8F;&#x6E10;&#x8FDB;&#x5730;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;</strong>&#x3002;&#x5728;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x88AB;&#x5212;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x76F8;&#x4E92;&#x8054;&#x7CFB;&#x4F46;&#x4E5F;&#x80FD;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x7684;&#x5B50;&#x9879;&#x76EE;&#x3002;&#x8FD9;&#x5C31;&#x4F7F;&#x5F97;&#x6BCF;&#x4E2A;&#x5B50;&#x9879;&#x76EE;&#x5728;&#x5F00;&#x53D1;&#x3001;&#x6D4B;&#x8BD5;&#x76F4;&#x81F3;&#x5B8C;&#x6210;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x53EF;&#x4F7F;&#x7528;&#x7684;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x8981;&#x5F62;&#x6210;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x56E2;&#x961F;&#x4E4B;&#x6210;&#x5458;&#x4E4B;&#x95F4;&#x66F4;&#x52A0;&#x6709;&#x6548;&#x7684;&#x5408;&#x4F5C;&#x5173;&#x7CFB;&#xFF0C;&#x4F7F;&#x5176;&#x7075;&#x6D3B;&#x6027;&#x66F4;&#x9AD8;&#xFF0C;&#x4EE5;&#x9002;&#x5E94;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x9700;&#x6C42;&#x3002;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E0E;&#x4F20;&#x7EDF;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x7684;&#x6700;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x5728;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x56E2;&#x961F;&#x662F;&#x6709;&#x6FC0;&#x60C5;&#x3001;&#x6709;&#x6D3B;&#x529B;&#x7684;&#xFF0C;&#x80FD;&#x591F;&#x9002;&#x5E94;&#x66F4;&#x5927;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x751F;&#x4EA7;&#x51FA;&#x66F4;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x4F18;&#x5148;&#x7EA7;&#x6700;&#x9AD8;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x7ED9;&#x5BA2;&#x6237;&#x63D0;&#x4F9B;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x3001;&#x53EF;&#x4EE5;&#x5DE5;&#x4F5C;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x56E0;&#x6B64;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x7ED9;&#x5BA2;&#x6237;&#x521B;&#x9020;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x654F;&#x6377;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#xFF1A;  </p>
<ul>
<li>&#x4E2A;&#x4F53;&#x548C;&#x4EA4;&#x4E92;&#x91CD;&#x4E8E;&#x8FC7;&#x7A0B;&#x548C;&#x5DE5;&#x5177;<br>  &#x4EBA;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x4EBA;&#x4E0E;&#x4EBA;&#x9762;&#x5BF9;&#x9762;&#x7684;&#x4EA4;&#x6D41;&#xFF0C;&#x662F;&#x6700;&#x6709;&#x6548;&#x3001;&#x6700;&#x8FC5;&#x901F;&#x7684;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x5F0F;&#x3002;</li>
<li>&#x53EF;&#x4EE5;&#x5DE5;&#x4F5C;&#x7684;&#x8F6F;&#x4EF6;&#x91CD;&#x4E8E;&#x9762;&#x9762;&#x4FF1;&#x5230;&#x7684;&#x6587;&#x6863;<br>  &#x654F;&#x6377;&#x65B9;&#x6CD5;&#x8BA4;&#x4E3A;&#x6700;&#x6839;&#x672C;&#x7684;&#x6587;&#x6863;&#x5C31;&#x662F;&#x6E90;&#x7801;&#x3002;</li>
<li>&#x5BA2;&#x6237;&#x534F;&#x4F5C;&#x91CD;&#x4E8E;&#x5408;&#x540C;&#x8C08;&#x5224;<br>  &#x5F00;&#x53D1;&#x56E2;&#x961F;&#x548C;&#x5BA2;&#x6237;&#x4E4B;&#x95F4;&#x771F;&#x8BDA;&#x7684;&#x534F;&#x4F5C;&#xFF0C;&#x52A0;&#x4E0A;&#x9891;&#x7E41;&#x7684;&#x5BA2;&#x6237;&#x53CD;&#x9988;&#xFF0C;&#x624D;&#x80FD;&#x8BA9;&#x9879;&#x76EE;&#x8D70;&#x5411;&#x6210;&#x529F;&#x3002;</li>
<li>&#x968F;&#x65F6;&#x54CD;&#x5E94;&#x53D8;&#x5316;&#x91CD;&#x4E8E;&#x5FAA;&#x89C4;&#x8E48;&#x77E9;<br>  &#x968F;&#x65F6;&#x54CD;&#x5E94;&#x53D8;&#x5316;&#x7684;&#x80FD;&#x529B;&#x5F80;&#x5F80;&#x51B3;&#x5B9A;&#x7740;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x6210;&#x8D25;&#x3002;&#x654F;&#x6377;&#x65B9;&#x6CD5;&#x6B22;&#x8FCE;&#x5E76;&#x4E14;&#x968F;&#x65F6;&#x51C6;&#x5907;&#x5E94;&#x5BF9;&#x53D8;&#x5316;&#x3002;&#x4E3A;&#x4FDD;&#x969C;&#x654F;&#x6377;&#x56E2;&#x961F;&#x6210;&#x5458;&#x66F4;&#x597D;&#x7684;&#x805A;&#x7126;&#x5F00;&#x53D1;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x5BF9;&#x5F53;&#x524D;&#x8FED;&#x4EE3;&#x5468;&#x671F;&#x7684;&#x9700;&#x6C42;&#x8FDB;&#x884C;&#x53D8;&#x5316;&#x3002;</li>
</ul>
<p>&#x654F;&#x6377;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x6982;&#x62EC;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x201C;<strong>&#x9002;&#x5E94;&#x53D8;&#x5316;</strong>&#x201D;&#x548C;&#x201C;<strong>&#x4EE5;&#x4EBA;&#x4E3A;&#x672C;</strong>&#x201D;&#x3002;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x662F;&#x9762;&#x5411;&#x4EBA;&#x7684;&#x800C;&#x975E;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x3002;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x662F;&#x201C;&#x4E3B;&#x52A8;&#x9002;&#x5E94;&#x7684;&#x201D;&#x800C;&#x4E0D;&#x662F;&#x201C;&#x9884;&#x5148;&#x8BBE;&#x5B9A;&#x7684;&#x201D;&#x3002;</p>
<p>&#x654F;&#x6377;&#x5F00;&#x53D1;&#x7684;&#x7406;&#x5FF5;&#x5C31;&#x662F;&#x4FE1;&#x4EFB;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x5730;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x7BA1;&#x7406;&#x90FD;&#x662F;&#x56F4;&#x7ED5;&#x8FD9;&#x4E2A;&#x7406;&#x5FF5;&#x5C55;&#x5F00;&#x7684;&#x3002;</p>
<p>&#x654F;&#x6377;&#x5F00;&#x53D1;&#x7684;&#x672C;&#x8D28;&#xFF0C;&#x7B2C;&#x4E00;&#x662F;&#x4E00;&#x5207;&#x6D3B;&#x52A8;&#x4EE5;&#x4EF7;&#x503C;&#x4E3A;&#x5BFC;&#x5411;&#xFF0C;&#x7B2C;&#x4E8C;&#x662F;&#x4EE5;&#x4EBA;&#x4E3A;&#x672C;&#x3002;&#x4EE5;&#x4EF7;&#x503C;&#x4E3A;&#x5BFC;&#x5411;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x6548;&#x76CA;&#xFF0C;&#x4EE5;&#x4EBA;&#x4E3A;&#x672C;&#x7684;&#x7CBE;&#x795E;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x6548;&#x7387;&#x3002;</p>
<p>&#x654F;&#x6377;&#x5F00;&#x53D1;&#x4E5F;&#x9700;&#x8981;&#x6587;&#x6863;&#xFF0C;&#x4E5F;&#x540C;&#x6837;&#x8981;&#x8BA1;&#x5212;&#x3002;&#x4F46;&#x4E0D;&#x503C;&#x5F97;&#x5728;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x4E0A;&#x82B1;&#x8D39;&#x8FC7;&#x591A;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x53EF;&#x5DE5;&#x4F5C;&#x7684;&#x8F6F;&#x4EF6;&#x624D;&#x662F;&#x654F;&#x6377;&#x65B9;&#x6CD5;&#x5173;&#x6CE8;&#x7684;&#x91CD;&#x70B9;&#x3002;</p>
<p>&#x654F;&#x6377;&#x5F00;&#x53D1;&#x4E0D;&#x662F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x6240;&#x6709;&#x95EE;&#x9898;&#x7684;&#x94F6;&#x5F39;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x654F;&#x6377;&#x5E76;&#x4E0D;&#x8981;&#x6C42;&#x4F60;&#x4EEC;&#x4E00;&#x6210;&#x4E0D;&#x53D8;&#x5730;&#x9075;&#x5FAA;&#x8FD9;&#x4E9B;&#x6761;&#x6761;&#x6846;&#x6846;&#xFF0C;&#x9047;&#x5230;&#x56F0;&#x96BE;&#x65F6;&#x5E94;&#x8BE5;&#x7075;&#x6D3B;&#x5730;&#x8C03;&#x6574;&#x7B56;&#x7565;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x771F;&#x6B63;&#x8FBE;&#x5230;&#x4E86;&#x654F;&#x6377;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<h3 id="&#x4EC0;&#x4E48;&#x662F;scrum&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;Scrum&#xFF1F;</h3>
<p>Scrum &#x662F;&#x4E00;&#x79CD;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#xFF0C;&#x76EE;&#x524D;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x6D41;&#x884C;&#x7684;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x3002;</p>
<p><em>&#x5176;&#x4ED6;&#x7684;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x6709;&#xFF1A;&#x6781;&#x9650;&#x7F16;&#x7A0B;&#xFF08;eXtreme Programming&#xFF0C;XP&#xFF09;&#x3001;RUP&#xFF08;Rational Unify Process&#xFF0C;Ratioanl &#x7EDF;&#x4E00;&#x8FC7;&#x7A0B;&#xFF09;&#x3001; Lean&#xFF08;&#x7CBE;&#x76CA;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#xFF09;</em></p>
<p>Scrum &#x662F;&#x4E00;&#x79CD;&#x7075;&#x6D3B;&#x7684;&#x654F;&#x6377;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7BA1;&#x7406;&#x8FC7;&#x7A0B;&#xFF0C;&#x7531; Ken Schwaber &#x548C; Jeff Sutherland &#x63D0;&#x51FA;&#xFF0C;&#x8FD9;&#x4E2A;&#x540D;&#x8BCD;&#x6765;&#x6E90;&#x4E8E;&#x82F1;&#x5F0F;&#x6A44;&#x6984;&#x7403;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x529F;&#x80FD;&#x9700;&#x6C42;&#x53EF;&#x80FD;&#x7ECF;&#x5E38;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x7684;&#x9879;&#x76EE;&#x6765;&#x8BF4;&#xFF0C;Scrum &#x662F;&#x6700;&#x4E3A;&#x7406;&#x60F3;&#x7684;&#x9009;&#x62E9;&#x4E4B;&#x4E00;&#x3002;</p>
<h3 id="scrum&#x4E2D;&#x7684;&#x4E09;&#x79CD;&#x89D2;&#x8272;&#xFF08;roles&#xFF09;">Scrum&#x4E2D;&#x7684;&#x4E09;&#x79CD;&#x89D2;&#x8272;&#xFF08;Roles&#xFF09;</h3>
<ul>
<li>&#x4EA7;&#x54C1;&#x8D1F;&#x8D23;&#x4EBA;&#xFF08;PO: Product Owner&#xFF09;  <ul>
<li>&#x9700;&#x8981;&#x786E;&#x5B9A;&#x4EA7;&#x54C1;&#x7684;&#x529F;&#x80FD;&#x548C;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x5BF9;&#x4EA7;&#x54C1;&#x7684;&#x6536;&#x76CA;&#x8D1F;&#x8D23;&#xFF0C;&#x8981;&#x6839;&#x636E;&#x5E02;&#x573A;&#x9700;&#x6C42;&#x786E;&#x5B9A;&#x4EA7;&#x54C1;&#x529F;&#x80FD;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x3002;</li>
<li>&#x5728;&#x6BCF;&#x4E2A; Sprint &#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;Product Owner &#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x529F;&#x80FD;&#x9700;&#x6C42;&#x548C;&#x4F18;&#x5148;&#x7EA7;&#x3002;</li>
<li>&#x6709;&#x6743;&#x51B3;&#x5B9A;&#x63A5;&#x53D7;&#x6216;&#x5426;&#x51B3;&#x5404;&#x4E2A; Sprint &#x7684;&#x5DE5;&#x4F5C;&#x6210;&#x679C;&#x3002; </li>
<li>&#x901A;&#x5E38;&#x7531;&#x5E02;&#x573A;&#x90E8;&#x95E8;&#x7684;&#x4EBA;&#x5458;&#x6216;&#x5F00;&#x53D1;&#x90E8;&#x95E8;&#x5185;&#x90E8;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x8BE5;&#x4EA7;&#x54C1;&#x4EBA;&#x5458;&#x6765;&#x62C5;&#x4EFB;&#x3002;</li>
</ul>
</li>
<li>&#x654F;&#x6377;&#x6559;&#x7EC3;&#xFF08;SM: Scrum Master)<ul>
<li>&#x8D1F;&#x8D23;&#x76D1;&#x7763;&#x6574;&#x4E2A; Scrum &#x9879;&#x76EE;&#x8FDB;&#x7A0B;&#xFF0C;&#x8C03;&#x6574;&#x9879;&#x76EE;&#x8BA1;&#x5212;&#x3002;</li>
<li>&#x786E;&#x4FDD;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x6210;&#x5458;&#x7684;&#x80FD;&#x529B;&#x80FD;&#x591F;&#x80DC;&#x4EFB;&#x4EA7;&#x54C1;&#x7684;&#x5F00;&#x53D1;&#x3002;</li>
<li>&#x4FC3;&#x8FDB;&#x56E2;&#x961F;&#x4E2D;&#x4E0D;&#x540C;&#x89D2;&#x8272;&#x7684;&#x6210;&#x5458;&#x95F4;&#x5145;&#x5206;&#x4EA4;&#x6D41;&#x548C;&#x6C9F;&#x901A;&#xFF0C;&#x5E76;&#x8D1F;&#x8D23;&#x4E3A;&#x9879;&#x76EE;&#x7684;&#x8FDB;&#x884C;&#x626B;&#x9664;&#x969C;&#x788D;&#x3002;</li>
<li>&#x4FDD;&#x8BC1;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x4E0D;&#x53D7;&#x5916;&#x529B;&#x7684;&#x5E72;&#x6270;&#x548C;&#x963B;&#x6320;&#x3002;</li>
<li>&#x638C;&#x63E1;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x8FDB;&#x5EA6;&#xFF0C;&#x53C2;&#x4E0E;&#x6BCF;&#x65E5; Scrum &#x4F1A;&#x8BAE;&#x3001;Sprint &#x8BA1;&#x5212;&#x4F1A;&#x8BAE;&#x548C; Sprint &#x8BC4;&#x5BA1;&#x4F1A;&#x8BAE;&#x3002;</li>
</ul>
</li>
<li>&#x654F;&#x6377;&#x56E2;&#x961F;&#xFF08;Scrum Team&#xFF09;<ul>
<li>&#x4E00;&#x822C;&#x7531; 5&#xFF5E;10 &#x4E2A;&#x80FD;&#x5168;&#x804C;&#x5DE5;&#x4F5C;&#x7684;&#x6210;&#x5458;&#x7EC4;&#x6210;&#x8F83;&#x4E3A;&#x7406;&#x60F3;&#x3002; </li>
<li>&#x56E2;&#x961F;&#x6210;&#x5458;&#x6A2A;&#x8DE8;&#x5404;&#x4E2A;&#x804C;&#x80FD;&#xFF0C;&#x901A;&#x5E38;&#x5305;&#x542B;&#x5F00;&#x53D1;&#x3001;&#x6D4B;&#x8BD5;&#x3001;&#x6587;&#x6863;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x7B49;&#x3002;</li>
</ul>
</li>
</ul>
<h3 id="scrum&#x7684;&#x4E09;&#x79CD;&#x5DE5;&#x4EF6;&#xFF08;artifacts&#xFF09;">Scrum&#x7684;&#x4E09;&#x79CD;&#x5DE5;&#x4EF6;&#xFF08;Artifacts&#xFF09;</h3>
<ul>
<li>&#x4EA7;&#x54C1;&#x529F;&#x80FD;&#x5217;&#x8868;&#xFF08;Product Backlog&#xFF09;</li>
<li>&#x51B2;&#x523A;&#x5217;&#x8868;&#xFF08;Sprint Backlog&#xFF09;</li>
<li>&#x71C3;&#x5C3D;&#x56FE;&#xFF08;Burn-DownChart&#xFF09;</li>
</ul>
<h3 id="scrum&#x7684;&#x56DB;&#x79CD;&#x4F1A;&#x8BAE;&#x4EEA;&#x5F0F;&#xFF08;ceremonies&#xFF09;">Scrum&#x7684;&#x56DB;&#x79CD;&#x4F1A;&#x8BAE;/&#x4EEA;&#x5F0F;&#xFF08;Ceremonies&#xFF09;</h3>
<ul>
<li>&#x8FED;&#x4EE3;&#x8BA1;&#x5212;&#x4F1A;&#x8BAE;&#xFF08;Sprint Planning Meeting&#xFF09;</li>
<li>&#x8FED;&#x4EE3;&#x8BC4;&#x5BA1;&#x4F1A;&#x8BAE;&#xFF08;Sprint Review Meeting&#xFF09;</li>
<li>&#x8FED;&#x4EE3;&#x56DE;&#x987E;&#x4F1A;&#x8BAE;&#xFF08;Sprint Retrospective Meeting&#xFF09;</li>
<li>&#x6BCF;&#x65E5;&#x7AD9;&#x4F1A;&#xFF08;Daily Scrum Meeting&#xFF09;</li>
</ul>
<h3 id="scrum&#x7684;&#x6D41;&#x7A0B;">Scrum&#x7684;&#x6D41;&#x7A0B;</h3>
<p>&#x9996;&#x5148;&#x8981;&#x5C06;&#x6240;&#x6709;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x5217;&#x5728;&#x4E00;&#x4E2A; <strong>Product Backlog</strong> &#x4E2D;&#xFF0C;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x6C42;&#x7684;&#x6539;&#x53D8;&#x4E5F;&#x8981;&#x5199;&#x8FDB;&#x53BB;&#x3002;&#x5728;&#x6BCF;&#x4E2A; <strong>Sprint</strong> &#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x8981;&#x53EC;&#x5F00;&#x4E00;&#x4E2A; <strong>Sprint &#x8BA1;&#x5212;&#x4F1A;&#x8BAE;</strong>&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F1A;&#x4E0A;&#xFF0C;<strong>&#x4EA7;&#x54C1;&#x8D23;&#x4EFB;&#x4EBA;&#xFF08;Product Owner&#xFF09;</strong> &#x4E3A; Product Backlog &#x4E2D;&#x7684;&#x5404;&#x9879;&#x529F;&#x80FD;&#x9700;&#x6C42;&#x786E;&#x5B9A;&#x4F18;&#x5148;&#x7EA7;&#x3002;&#x968F;&#x540E;&#xFF0C;<strong>Scrum &#x5F00;&#x53D1;&#x56E2;&#x961F;</strong>&#x6309;&#x7167;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x4ECE; Product Backlog &#x4E2D;&#x6311;&#x9009;&#x51FA;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x80FD;&#x5728;&#x8FD9;&#x4E2A; Sprint &#x4E2D;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76;&#x628A;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x4ECE; Product Backlog &#x4E2D;&#x632A;&#x5230; <strong>Sprint Backlog</strong> &#x4E2D;&#x53BB;&#x3002;&#x5728; Sprint &#x7684;&#x8FDB;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;Scrum &#x56E2;&#x961F;&#x6BCF;&#x5929;&#x90FD;&#x8981;&#x4E3E;&#x884C;&#x4E00;&#x4E2A;&#x7B80;&#x77ED;&#x7684;<strong>&#x6BCF;&#x65E5; Scrum &#x4F1A;&#x8BAE;</strong>&#xFF0C;&#x4EE5;&#x4FBF;&#x56E2;&#x961F;&#x6210;&#x5458;&#x4E86;&#x89E3;&#x5F00;&#x53D1;&#x8FDB;&#x5EA6;&#x3002;&#x4E00;&#x4E2A; Sprint &#x7ED3;&#x675F;&#x4E4B;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x53EC;&#x5F00; <strong>Sprint &#x8BC4;&#x5BA1;&#x4F1A;&#x8BAE;</strong>&#x548C; <strong>Sprint &#x56DE;&#x987E;&#x4F1A;&#x8BAE;</strong>&#x3002;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x5728; Sprint &#x8BC4;&#x5BA1;&#x4F1A;&#x8BAE;&#x4E0A;&#x628A;&#x8FD9;&#x4E2A; Sprint &#x7684;&#x5F00;&#x53D1;&#x6210;&#x679C;&#x5C55;&#x793A;&#x7ED9;&#x5927;&#x5BB6;&#x3002;&#x800C;&#x5728; Sprint &#x56DE;&#x987E;&#x4F1A;&#x8BAE;&#x4E0A;&#xFF0C;&#x56E2;&#x961F;&#x6210;&#x5458;&#x4EEC;&#x4F1A;&#x56DE;&#x987E;&#x521A;&#x521A;&#x8FC7;&#x53BB;&#x7684;&#x8FD9;&#x4E2A; Sprint&#xFF0C;&#x4ECE;&#x4E2D;&#x603B;&#x7ED3;&#x7ECF;&#x9A8C;&#x548C;&#x6559;&#x8BAD;&#x3002;</p>

                                </div>
                                
                                <!-- page -->

                            </div>
                            <div class="search-results">
                                <div class="has-results">
                                    
                                    <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
                                    <ul class="search-results-list"></ul>
                                    
                                </div>
                                <div class="no-results">
                                    
                                    <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
                                    
                                </div>
                            </div>
                        </div>
                        <!-- search_result -->
                    </div>
                </div>
            </div>
        </div>
    </div>

    <footer class="gb-page-footer">
        <div class="container footer-container">
            <div class="copyright">
                © 2019 <a href="http://baronzhao.com">赵国勇</a> all right reserved，powered by Gitbook
            </div>
        </div>
    </footer>
</div>

<script src="../gitbook/gitbook.js"></script>

    
    <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
    


<script>
    var gitbook = gitbook || [];
    gitbook.push(function() {
        gitbook.page.hasChanged({"page":{"title":"轻松Scrum之旅1","level":"1.3.2","depth":2,"next":{"title":"验证码组件Kaptcha","level":"1.3.3","depth":2,"path":"tech/202001-java-kaptcha.md","ref":"tech/202001-java-kaptcha.md","articles":[]},"previous":{"title":"Markdown语法","level":"1.3.1","depth":2,"path":"tech/201901-markdown-rules.md","ref":"tech/201901-markdown-rules.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-sharing","-fontsettings","-lunr","-search","search-pro","theme-official","sitemap-general"],"root":"./","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"sitemap-general":{"prefix":"http://www.baronzhao.com/"},"search-pro":{},"highlight":{},"theme-official":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","head_keywords":"Baron Zhao's Blog","logo":"assets/images/logo.png","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Baron Zhao's Blog","language":"zh-hans","icon":"assets/images/favicon.ico","head_title":" : Baron Zhao's Blog","gitbook":">= 3.0.0","description":"好记性不如烂笔头，记录日常遇到的问题及学习的成果","head_description":"好记性不如烂笔头，记录日常遇到的问题及学习的成果"},"file":{"path":"tech/201901-easy-scrum-tour-1.md","mtime":"2020-03-22T03:39:53.879Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-03-22T04:47:33.928Z"},"basePath":"..","book":{"language":""}});
    });
</script>
<script>
    $('.book-page-inner h1,.book-page-inner h2,.book-page-inner h3,.book-page-inner h4,.book-page-inner h5,.book-page-inner h6').click(function(){
        var id = $(this).attr('id');
        if(id) {
            window.location.hash=id;
        }
    });
</script>
<script>
    var _hmt = _hmt || [];
    (function() {
        var hm = document.createElement("script");
        hm.src = "https://hm.baidu.com/hm.js?8bf88b96b976f6ee6e6c215f2867fcdc";
        var s = document.getElementsByTagName("script")[0]; 
        s.parentNode.insertBefore(hm, s);
    })();
</script>

        
    </body>
</html>

